shop/app/controllers/line_items_controller.rb

  def create
    @cart = current_cart
	product = Product.find(params[:product_id])
	@line_item = @cart.add_product(product)

    respond_to do |format|
      if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = 1 LIMIT 1
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at", "quantity", "order_id") VALUES (1, 1, '2012-07-17 21:44:27.519438', '2012-07-17 21:44:27.519438', 1, NULL)
UPDATE "line_items" SET "quantity" = 2, "updated_at" = '2012-07-17 21:44:46.928441' WHERE "line_items"."id" = 2