shop/app/controllers/orders_controller.rb

  def index
    @orders = Order.all
---
SELECT "orders".* FROM "orders"

  def new
  @cart = current_cart
   if @cart.line_items.empty?
---
SELECT "line_items".* FROM "line_items" WHERE ("line_items".cart_id = 2)
SELECT COUNT(*) FROM "line_items" WHERE ("line_items".cart_id = 2)

  def create
      @order = Order.new(params[:order])
   	  @order.add_line_items_from_cart(current_cart)

     respond_to do |format|
       if @order.save
       	 Cart.destroy(session[:cart_id])
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES ('2012-07-18 00:53:32.952404', '2012-07-18 00:53:32.952404')
INSERT INTO "orders" ("name", "address", "email", "pay_type", "created_at", "updated_at") VALUES ('aSas', 'ASas', 'ASas', 'Mastercard', '2012-07-18 00:52:38.273370', '2012-07-18 00:52:38.273370')
DELETE FROM "carts" WHERE "carts"."id" = 4