shop/app/controllers/products_controller.rb

  def index
	@products = Product.search(params[:search_query])
---
SELECT "products".* FROM "products" WHERE (title LIKE '%wqwe%')